GopalSaraf/Practicals/PSDL/include/proc/pic16f18015.h
// Register: IOCAF
#define IOCAF IOCAF
extern volatile unsigned char           IOCAF               __at(0x1E93);
#ifndef _LIB_BUILD
asm("IOCAF equ 01E93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAF0                 :1;
        unsigned IOCAF1                 :1;
        unsigned IOCAF2                 :1;
        unsigned IOCAF3                 :1;
        unsigned IOCAF4                 :1;
        unsigned IOCAF5                 :1;
    };
} IOCAFbits_t;
extern volatile IOCAFbits_t IOCAFbits __at(0x1E93);
// bitfield macros
#define _IOCAF_IOCAF0_POSN                                  0x0
#define _IOCAF_IOCAF0_POSITION                              0x0
#define _IOCAF_IOCAF0_SIZE                                  0x1
#define _IOCAF_IOCAF0_LENGTH                                0x1
#define _IOCAF_IOCAF0_MASK                                  0x1
#define _IOCAF_IOCAF1_POSN                                  0x1
#define _IOCAF_IOCAF1_POSITION                              0x1
#define _IOCAF_IOCAF1_SIZE                                  0x1
#define _IOCAF_IOCAF1_LENGTH                                0x1
#define _IOCAF_IOCAF1_MASK                                  0x2
#define _IOCAF_IOCAF2_POSN                                  0x2
#define _IOCAF_IOCAF2_POSITION                              0x2
#define _IOCAF_IOCAF2_SIZE                                  0x1
#define _IOCAF_IOCAF2_LENGTH                                0x1
#define _IOCAF_IOCAF2_MASK                                  0x4
#define _IOCAF_IOCAF3_POSN                                  0x3
#define _IOCAF_IOCAF3_POSITION                              0x3
#define _IOCAF_IOCAF3_SIZE                                  0x1
#define _IOCAF_IOCAF3_LENGTH                                0x1
#define _IOCAF_IOCAF3_MASK                                  0x8
#define _IOCAF_IOCAF4_POSN                                  0x4
#define _IOCAF_IOCAF4_POSITION                              0x4
#define _IOCAF_IOCAF4_SIZE                                  0x1
#define _IOCAF_IOCAF4_LENGTH                                0x1
#define _IOCAF_IOCAF4_MASK                                  0x10
#define _IOCAF_IOCAF5_POSN                                  0x5
#define _IOCAF_IOCAF5_POSITION                              0x5
#define _IOCAF_IOCAF5_SIZE                                  0x1
#define _IOCAF_IOCAF5_LENGTH                                0x1
#define _IOCAF_IOCAF5_MASK                                  0x20

// Register: RA1I2C
#define RA1I2C RA1I2C
extern volatile unsigned char           RA1I2C              __at(0x1EE1);
#ifndef _LIB_BUILD
asm("RA1I2C equ 01EE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
} RA1I2Cbits_t;
extern volatile RA1I2Cbits_t RA1I2Cbits __at(0x1EE1);
// bitfield macros
#define _RA1I2C_TH_POSN                                     0x0
#define _RA1I2C_TH_POSITION                                 0x0
#define _RA1I2C_TH_SIZE                                     0x2
#define _RA1I2C_TH_LENGTH                                   0x2
#define _RA1I2C_TH_MASK                                     0x3
#define _RA1I2C_PU_POSN                                     0x4
#define _RA1I2C_PU_POSITION                                 0x4
#define _RA1I2C_PU_SIZE                                     0x2
#define _RA1I2C_PU_LENGTH                                   0x2
#define _RA1I2C_PU_MASK                                     0x30
#define _RA1I2C_SLEW_POSN                                   0x6
#define _RA1I2C_SLEW_POSITION                               0x6
#define _RA1I2C_SLEW_SIZE                                   0x2
#define _RA1I2C_SLEW_LENGTH                                 0x2
#define _RA1I2C_SLEW_MASK                                   0xC0

// Register: RA2I2C
#define RA2I2C RA2I2C
extern volatile unsigned char           RA2I2C              __at(0x1EE2);
#ifndef _LIB_BUILD
asm("RA2I2C equ 01EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
} RA2I2Cbits_t;
extern volatile RA2I2Cbits_t RA2I2Cbits __at(0x1EE2);
// bitfield macros
#define _RA2I2C_TH_POSN                                     0x0
#define _RA2I2C_TH_POSITION                                 0x0
#define _RA2I2C_TH_SIZE                                     0x2
#define _RA2I2C_TH_LENGTH                                   0x2
#define _RA2I2C_TH_MASK                                     0x3
#define _RA2I2C_PU_POSN                                     0x4
#define _RA2I2C_PU_POSITION                                 0x4
#define _RA2I2C_PU_SIZE                                     0x2
#define _RA2I2C_PU_LENGTH                                   0x2
#define _RA2I2C_PU_MASK                                     0x30
#define _RA2I2C_SLEW_POSN                                   0x6
#define _RA2I2C_SLEW_POSITION                               0x6
#define _RA2I2C_SLEW_SIZE                                   0x2
#define _RA2I2C_SLEW_LENGTH                                 0x2
#define _RA2I2C_SLEW_MASK                                   0xC0

// Register: UMTOAP
#define UMTOAP UMTOAP
extern volatile unsigned char           UMTOAP              __at(0x1F0C);
#ifndef _LIB_BUILD
asm("UMTOAP equ 01F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAP                 :8;
    };
} UMTOAPbits_t;
extern volatile UMTOAPbits_t UMTOAPbits __at(0x1F0C);
// bitfield macros
#define _UMTOAP_UMTOAP_POSN                                 0x0
#define _UMTOAP_UMTOAP_POSITION                             0x0
#define _UMTOAP_UMTOAP_SIZE                                 0x8
#define _UMTOAP_UMTOAP_LENGTH                               0x8
#define _UMTOAP_UMTOAP_MASK                                 0xFF

// Register: UMTOAL
#define UMTOAL UMTOAL
extern volatile unsigned char           UMTOAL              __at(0x1F0D);
#ifndef _LIB_BUILD
asm("UMTOAL equ 01F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAL                 :8;
    };
} UMTOALbits_t;
