GopalSaraf/Practicals/PSDL/include/proc/pic16f18015.h
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE2<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x4C2);	// @ (0x98 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR2,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF0F0);	// @ (0x1E1E * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF0F1);	// @ (0x1E1E * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF0F2);	// @ (0x1E1E * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF0F3);	// @ (0x1E1E * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF0F4);	// @ (0x1E1E * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1C97);	// @ (0x392 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x4C3);	// @ (0x98 * 8 + 3)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,3)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF0F8);	// @ (0x1E1F * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF0F9);	// @ (0x1E1F * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF0FA);	// @ (0x1E1F * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF0FB);	// @ (0x1E1F * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF0FC);	// @ (0x1E1F * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8062);	// @ (0x100C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8063);	// @ (0x100C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x347E);	// @ (0x68F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// NCO1CLK<CKS0>
extern volatile __bit                   CKS0                __at(0x2498);	// @ (0x493 * 8 + 0)
#define                                 CKS0_bit            _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<CKS1>
extern volatile __bit                   CKS1                __at(0x2499);	// @ (0x493 * 8 + 1)
#define                                 CKS1_bit            _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<CKS2>
extern volatile __bit                   CKS2                __at(0x249A);	// @ (0x493 * 8 + 2)
#define                                 CKS2_bit            _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<CKS3>
extern volatile __bit                   CKS3                __at(0x249B);	// @ (0x493 * 8 + 3)
#define                                 CKS3_bit            _BIT_ACCESS(NCO1CLK,3)
// PIE2<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x4C6);	// @ (0x98 * 8 + 6)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR2,6)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE2<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x4C7);	// @ (0x98 * 8 + 7)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR2,7)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,0)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE3<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR3,1)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0xF1E8);	// @ (0x1E3D * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0xF1E9);	// @ (0x1E3D * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0xF1EA);	// @ (0x1E3D * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0xF1EB);	// @ (0x1E3D * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0xF1EC);	// @ (0x1E3D * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0xF1F0);	// @ (0x1E3E * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0xF1F8);	// @ (0x1E3F * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0xF200);	// @ (0x1E40 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0xF201);	// @ (0x1E40 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0xF202);	// @ (0x1E40 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF203);	// @ (0x1E40 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF204);	// @ (0x1E40 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// PIE4<CM1IE>
extern volatile __bit                   CM1IE               __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE4,2)
// PIR4<CM1IF>
extern volatile __bit                   CM1IF               __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR4,2)
// ADCNT<CNT0>
extern volatile __bit                   CNT0                __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 CNT0_bit            _BIT_ACCESS(ADCNT,0)
// ADCNT<CNT1>
extern volatile __bit                   CNT1                __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 CNT1_bit            _BIT_ACCESS(ADCNT,1)
// ADCNT<CNT2>
extern volatile __bit                   CNT2                __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 CNT2_bit            _BIT_ACCESS(ADCNT,2)
// ADCNT<CNT3>
extern volatile __bit                   CNT3                __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 CNT3_bit            _BIT_ACCESS(ADCNT,3)
// ADCNT<CNT4>
extern volatile __bit                   CNT4                __at(0xE8CC);	// @ (0x1D19 * 8 + 4)
#define                                 CNT4_bit            _BIT_ACCESS(ADCNT,4)
// ADCNT<CNT5>
extern volatile __bit                   CNT5                __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 CNT5_bit            _BIT_ACCESS(ADCNT,5)
// ADCNT<CNT6>
extern volatile __bit                   CNT6                __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 CNT6_bit            _BIT_ACCESS(ADCNT,6)
// ADCNT<CNT7>
extern volatile __bit                   CNT7                __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 CNT7_bit            _BIT_ACCESS(ADCNT,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1074);	// @ (0x20E * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1075);	// @ (0x20E * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1076);	// @ (0x20E * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// CPCON<CPOS>
extern volatile __bit                   CPOS                __at(0x806D);	// @ (0x100D * 8 + 5)
#define                                 CPOS_bit            _BIT_ACCESS(CPCON,5)
// CPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x8068);	// @ (0x100D * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(CPCON,0)
// CPCON<CPREQ>
extern volatile __bit                   CPREQ               __at(0x806A);	// @ (0x100D * 8 + 2)
#define                                 CPREQ_bit           _BIT_ACCESS(CPCON,2)
// CPCON<CPT>
extern volatile __bit                   CPT                 __at(0x8069);	// @ (0x100D * 8 + 1)
#define                                 CPT_bit             _BIT_ACCESS(CPCON,1)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0xE944);	// @ (0x1D28 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0xE945);	// @ (0x1D28 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0xE946);	// @ (0x1D28 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0xE96D);	// @ (0x1D2D * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x2860);	// @ (0x50C * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x2878);	// @ (0x50F * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x2879);	// @ (0x50F * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x2870);	// @ (0x50E * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x2871);	// @ (0x50E * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x2872);	// @ (0x50E * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x2887);	// @ (0x510 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE2<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x4C5);	// @ (0x98 * 8 + 5)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE2,5)
// PIR2<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR2,5)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x288D);	// @ (0x511 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x2886);	// @ (0x510 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x2892);	// @ (0x512 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x2893);	// @ (0x512 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
